config/InformationRegisters/ПричиныЗабраковкиПартий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПричиныЗабраковкиПартий</Name>
			<Comment>Причина брака в строке поступления товаров</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаЗабраковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаВнесенияЗаписи</Name>
					<Comment>Для отслеживания установки брака в старых документах</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПоступлениеТовара</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТовара</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/InformationRegisters/ТоварныеОтчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ТоварныеОтчеты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСверки</Name>
					<Comment>Дата последней сверки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопИнформация</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтменаЗапрета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаличиеРасхождений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Аптека</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/Enums/ДействияНадДокументами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ДействияНадДокументами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводНового</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеДаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмТабЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмШапка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмТабИШапка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгрузка</Name>
					<Comment>на аптеку</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Откорректирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоРасценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоУведомление</Name>
					<Comment>Для сообщений об ошибках.</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/Catalogs/Партии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Партии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.АССОРТИМЕНТНЫЙ_ПЛАН</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>при поступлении товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакуп</Name>
					<Comment>точная закупочная сумма при цене по прайсу поставщика с кол-вом десятичных знаков в дробной части более 2-х</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕИТЗакупки</Name>
					<Comment>Для правильного сопоставления закупочной цены и единицы измерения (коэффициента)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕИТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Comment>ссылка на серию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Серии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПроизводителяБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПартияРодитель</Name>
					<Comment>заполняется у партий возникших при переоценке товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БарКод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШКПТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДСРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаГосРегистрации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаименованияПроизводителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоступленияТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПоступленияТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНалогообложенияПоступленияТоваров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>К</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/WebServices/ave_documents/Ext/Module.bsl
Функция hellow()
	Возврат "Вас приветствует Web-сервис обработки документов АВЕ!";
КонецФункции

Функция set_brak(apt_code, pa_number, pa_date, part_number, reason, qnt)
	
	//part_number - это наименование партии (строка)
	
	Запрос=Новый Запрос();
	
	Запрос.Текст="ВЫБРАТЬ
	             |	ПоступлениеТовара.Ссылка
	             |ИЗ
	             |	Документ.ПоступлениеТовара КАК ПоступлениеТовара
	             |ГДЕ
	             |	ПоступлениеТовара.Склад.Код = &Код
	             |	И ПоступлениеТовара.Номер = &Номер
	             |	И НАЧАЛОПЕРИОДА(ПоступлениеТовара.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("Код",apt_code);
	Запрос.УстановитьПараметр("Номер",pa_number);
	Запрос.УстановитьПараметр("Дата",pa_date);
	
	Рез=Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,1); // документ не найден
	КонецЕсли;
	
	Выб=Рез.Выбрать();
	Выб.Следующий();
	
	Док=Выб.Ссылка.ПолучитьОбъект();
	
	СтрокаПартии=Док.Товар.Найти(Справочники.Партии.НайтиПоНаименованию(СокрЛП(part_number),Истина),"Партия");
	
	Если СтрокаПартии=Неопределено ТОгда
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,2); // Партия не найдена в документе
	КонецЕсли;
	
	Если СтрокаПартии.Количество-СтрокаПартии.Недовоз<qnt Тогда
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,3); // Количество  превышает количество поступившего товара.
	КонецЕсли;
	
	СтрокаПартии.БойБрак=qnt;
	
	СтрИзм=Док.Изменения.Добавить();
	СтрИзм.Сотрудник=ПараметрыСеанса.ТекущийСотр;
	СтрИзм.Дата =ТекущаяДата();
	СтрИзм.ТипИзм=Перечисления.ДействияНадДокументами.Откорректирован;
	СтрИзм.КомментарийИзменения="Изменен бой/брак по партии "+part_number+" установлено "+qnt;

	
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,4); // Не удалось перепровести документ поступления товара в офисе.
	КонецПопытки;
	
	МЗ=РегистрыСведений.ПричиныЗабраковкиПартий.СоздатьМенеджерЗаписи();
	МЗ.ПоступлениеТовара=Док.Ссылка;
	МЗ.Партия=СтрокаПартии.Партия;
	МЗ.Прочитать();
	
	МЗ.ДатаВнесенияЗаписи=ТекущаяДата();
	МЗ.ПричинаЗабраковки=СокрЛП(reason);
	МЗ.ПоступлениеТовара=Док.Ссылка;
	МЗ.Партия=СтрокаПартии.Партия;
	МЗ.Записать();
	
//---------------<Если все прошло удачно>---------------------------// GtG // 23.05.2013 11:59:34
	Возврат 0; //ОК
КонецФункции



Функция set_nedovoz(apt_code, pa_number, pa_date, part_number, qnt)
	//part_number - это наименование партии (строка)
	
	Запрос=Новый Запрос();
	
	Запрос.Текст="ВЫБРАТЬ
	             |	ПоступлениеТовара.Ссылка
	             |ИЗ
	             |	Документ.ПоступлениеТовара КАК ПоступлениеТовара
	             |ГДЕ
	             |	ПоступлениеТовара.Склад.Код = &Код
	             |	И ПоступлениеТовара.Номер = &Номер
	             |	И НАЧАЛОПЕРИОДА(ПоступлениеТовара.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("Код",apt_code);
	Запрос.УстановитьПараметр("Номер",pa_number);
	Запрос.УстановитьПараметр("Дата",pa_date);
	
	Рез=Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,1); // документ не найден
	КонецЕсли;
	
	Выб=Рез.Выбрать();
	Выб.Следующий();
	
	Док=Выб.Ссылка.ПолучитьОбъект();
	
	СтрокаПартии=Док.Товар.Найти(Справочники.Партии.НайтиПоНаименованию(СокрЛП(part_number),Истина),"Партия");
	
	Если СтрокаПартии=Неопределено ТОгда
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,2); // Партия не найдена в документе
	КонецЕсли;
	
	Если СтрокаПартии.Количество-СтрокаПартии.БойБрак<qnt Тогда
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,3); // Количество  превышает количество поступившего товара.
	КонецЕсли;
	
	СтрокаПартии.Недовоз=qnt;
	
	//-------------- Пересчет строки документа: ---------------	
	СтрокаПартии.КоличествоФакт=СтрокаПартии.Количество-СтрокаПартии.Недовоз;
	СтрокаПартии["ЦенаЗакуп"]=СтрокаПартии["ЦенаЗакупБезНДС"]+СтрокаПартии["ЦенаЗакупБезНДС"]/100*СтрокаПартии.СтавкаНДС.Ставка;
	СтрокаПартии["СуммаЗакуп"]=СтрокаПартии["ЦенаЗакуп"]*СтрокаПартии.КоличествоФАКТ; // !!! ПО ФАКТИЧЕСКОМУ КОЛВУ !!!
	СтрокаПартии["НДСЗакуп"]=СтрокаПартии["ЦенаЗакупБезНДС"]/100*СтрокаПартии.СтавкаНДС.Ставка*СтрокаПартии.КоличествоФАКТ;
	
	
	СтрокаПартии["СуммаРозн"]=СтрокаПартии["ЦенаРозн"]*СтрокаПартии.КоличествоФАКТ; // !!! ПО ФАКТИЧЕСКОМУ КОЛВУ !!! // GtG 31.07.2008 15:00:49 при недовозе при прямом приходе в аптеку
	СтрокаПартии.СуммаРозн = СтрокаПартии.ЦенаРозн*СтрокаПартии.КоличествоФакт;	
	СтрокаПартии.НДСРозн = ОМ3_ПолучитьНДСПоСуммеСНДСИСтавке(СтрокаПартии.СуммаРозн,СтрокаПартии.СтавкаНДС);
	СтрокаПартии.СуммаОтклоненийСНДС	= СтрокаПартии.ЦенаЗакуп*(СтрокаПартии.БойБрак+СтрокаПартии.Недовоз);
	
	//--------------	
	
	СтрИзм=Док.Изменения.Добавить();
	СтрИзм.Сотрудник=ПараметрыСеанса.ТекущийСотр;
	СтрИзм.Дата =ТекущаяДата();
	СтрИзм.ТипИзм=Перечисления.ДействияНадДокументами.Откорректирован;
	СтрИзм.КомментарийИзменения="Изменен недовоз по партии "+part_number+" установлено "+qnt;
	
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,4); // Не удалось перепровести документ поступления товара в офисе.
	КонецПопытки;
	
		
//---------------<Если все прошло удачно>---------------------------// GtG // 23.05.2013 11:59:34
	Возврат 0; //ОК

КонецФункции



Функция delete_to(apt_code,to_begin_date)
	// Вставить содержимое обработчика.
	
	Аптека=Справочники.МестаХранения.НайтиПоКоду(apt_code);
	
	Если Аптека.Пустая()=Истина или Аптека=Неопределено Тогда
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,5); // Аптека не найдена по указанному коду.
	КонецЕсли;	
	
	МЗ=РегистрыСведений.ТоварныеОтчеты.СоздатьМенеджерЗаписи();
	
	МЗ.Аптека=Аптека;
	
	МЗ.Прочитать();
	
	УдаленныйТОНачПериода=МЗ.НачПериода;
	УдаленныйТОКонПериода=МЗ.КонПериода;

	
	МЗ.Аптека=Аптека;
	
	МЗ.НачПериода=КонецДня( НачалоДня(to_begin_date)-100);
	МЗ.КонПериода=МЗ.НачПериода;
	МЗ.ДатаЗакрытия=МЗ.НачПериода;
	МЗ.ДатаСверки=ТекущаяДата();
	МЗ.ДопИнформация="Товарный отчет удален аптекой "+ТекущаяДата()+"
					|Период удаленного отчета С "+Формат(УдаленныйТОНачПериода,"ДЛФ=D")+" по "+Формат(УдаленныйТОКонПериода,"ДЛФ=D");
	МЗ.ОтменаЗапрета=ложь;
	
	
	Попытка
		МЗ.Записать();
	Исключение
		Возврат ТаблицаКодовОшибок.ПолучитьДлинныйКодОшибки(100,6); // Не удалось записать данные о сверке товарного отчета.
	КонецПопытки;
	
	
	
	
	
	
	
	
	
	
	//---------------<Если все прошло удачно>---------------------------// GtG // 23.05.2013 11:59:34
	Возврат 0;
КонецФункции
